ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
/*!

    Copyright (c) 2020, ZK Inc.

    All rights reserved.
*/

#include "bsp_i2c.h"
#include "project_select.h"
#include <string.h>
#include "main.h"
#include "OSPort.h"
#include "Message.h"
#include "MsgHndlr.h"
#include "IPMDevice.h"
#include "systick.h"
#include "IPMIConf.h"        
#include "api_subdevices.h"

#define USE_I2C0_AS_IPMB 1
#define USE_I2C1_AS_IPMB 1
#define I2C0_INTERRUPT_ENALBE
#define I2C1_INTERRUPT_ENALBE
#define I2C_CLOCK_100K  100000U
#define I2C_CLOCK_400K  400000U
static void i2c0_int(void);
static void i2c1_int(void);

static void i2c0_config(void);
#ifdef  I2C0_INTERRUPT_ENALBE
static void i2c0_nvic_config(void);
#endif
static void i2c0_gpio_config(void);
static void i2c0_rcu_config(void);

static void i2c1_config(void);
#ifdef  I2C1_INTERRUPT_ENALBE
static void i2c1_nvic_config(void);
#endif
static void i2c1_gpio_config(void);
static void i2c1_rcu_config(void);
#ifdef I2C2
static void i2c2_int(void);
static void i2c2_config(void);
static void i2c2_nvic_config(void);
static void i2c2_gpio_config(void);
static void i2c2_rcu_config(void);    
#endif

static bool i2c_bytes_write(uint32_t i2cx, uint8_t device_addr, const uint8_t *p_buffer, uint16_t len, int time_out);
static bool i2c_bytes_read(uint32_t i2cx, uint8_t device_addr, uint8_t read_addr, uint8_t *p_buffer, uint16_t len, int time_out);

void i2c_dualaddr_set(uint32_t i2c_periph, uint8_t dualaddr)
{
    /* configure address */
    dualaddr = dualaddr & I2C_SADDR1_ADDRESS2;
    I2C_SADDR1(i2c_periph) &= ~(I2C_SADDR1_ADDRESS2);
    I2C_SADDR1(i2c_periph) |= dualaddr;

    i2c_dualaddr_enable(i2c_periph, I2C_DUADEN_ENABLE);
}

uint8_t i2c_dualaddr_get(uint32_t i2c_periph)
{
    uint8_t addr8 = I2C_SADDR1(i2c_periph) &= (I2C_SADDR1_ADDRESS2);
    return addr8;
}

void i2c_int(void)
{
    SubDevice_Init();
	uint8_t addr8 = SubDevice_GetMySlaveAddress(NM_PRIMARY_IPMB_BUS);
    SetDevAddr(addr8);

    i2c_channel_init(I2C0);
    i2c_channel_init(I2C1);
#ifdef I2C2
    i2c_channel_init(I2C2); 
#endif
}

void i2c_channel_init(uint32_t i2cx)
{
    switch(i2cx)
    {
    case I2C0:
        i2c0_int();
        break;
    case I2C1:
        i2c1_int();
        break;
#ifdef I2C2
    case I2C2:
        i2c2_int();
        LOG_I("i2c2_int");
        break;
#endif
    default:
        break;
    }
}

static void i2c0_int(void)
{
    i2c0_rcu_config();
    i2c0_gpio_config();
#ifdef  I2C0_INTERRUPT_ENALBE
    i2c0_nvic_config();
#endif
    i2c0_config();
}

static void i2c1_int(void)
{
    i2c1_rcu_config();
    i2c1_gpio_config();
#ifdef  I2C1_INTERRUPT_ENALBE
    i2c1_nvic_config();
#endif
    i2c1_config();
}

static void i2c0_rcu_config(void)
{
    /* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C0_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C0_SDA_GPIO_CLK);
}

static void i2c1_rcu_config(void)
{
    /* enable I2C1 clock */
    rcu_periph_clock_enable(RCU_I2C1);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C1_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C1_SDA_GPIO_CLK);
}


/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_gpio_config(void)
{
    /* I2C0 and I2C1 GPIO ports */
    /* connect I2C0_SCL I2C0_SDA*/
    gpio_init(I2C0_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C0_SCL_PIN);
    gpio_init(I2C0_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C0_SDA_PIN);
#ifdef I2C0_REMAP
    gpio_pin_remap_config(GPIO_I2C0_REMAP, ENABLE);
#endif
}

/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_gpio_config(void)
{
    /* connect I2C1_SCL I2C1_SDA*/
    gpio_init(I2C1_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C1_SCL_PIN);
    gpio_init(I2C1_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C1_SDA_PIN);
#ifdef I2C1_REMAP
	#ifdef GD32F2x
    gpio_pin_remap1_config(GPIO_PCF5, GPIO_PCF5_I2C1_REMAP1, ENABLE);
	#endif
#endif
}


/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_config(void)
{
    // **************************** I2C0 *********************************************
    /* I2C clock configure */
    i2c_clock_config(I2C0, I2C_CLOCK_400K, I2C_DTCY_2);
    i2c_set_slave_addr(I2C0, SubDevice_GetMySlaveAddress(I2C0));

#ifdef  I2C0_INTERRUPT_ENALBE
    /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C0, I2C_INT_ERR);
    i2c_interrupt_enable(I2C0, I2C_INT_EV);
    i2c_interrupt_enable(I2C0, I2C_INT_BUF);
#endif
}

/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_config(void)
{
    // **************************** I2C1 *********************************************
    i2c_clock_config(I2C1, I2C_CLOCK_100K, I2C_DTCY_2);
    i2c_set_slave_addr(I2C1, SubDevice_GetMySlaveAddress(I2C1));

#ifdef  I2C1_INTERRUPT_ENALBE
    /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C1, I2C_INT_ERR);
    i2c_interrupt_enable(I2C1, I2C_INT_EV);
    i2c_interrupt_enable(I2C1, I2C_INT_BUF);
#endif
}


/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_nvic_config(void)
{
    nvic_irq_enable(I2C0_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C0_ER_IRQn, 8, 0);
}

/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_nvic_config(void)
{
    nvic_irq_enable(I2C1_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C1_ER_IRQn, 8, 0);
}


/**
  * @brief   
  * @param   
  *	@arg p_buffer: 
  *	@arg 
  * @arg len:
  * @retval  ?
  */
bool i2c_bytes_write(uint32_t i2cx, uint8_t device_addr, const uint8_t *p_buffer, uint16_t len, int time_out)
{
    int i = 0;
    int timeout = time_out;
    int err_code = 0;   
	UNUSED(err_code);

    /* disable I2C0 interrupt */
    i2c_interrupt_disable(i2cx, I2C_INT_BUF);
    i2c_interrupt_disable(i2cx, I2C_INT_EV);

