ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
    return true;

__exit:
    i2c_deinit(i2cx);
    i2c_channel_init(i2cx);
    LOG_E("I2C write & read err code: %d.", err_code);
    return false;
}

extern xQueueHandle RecvDatMsg_Queue;
extern xQueueHandle RecvForwardI2CDatMsg_Queue;
static MsgPkt_T    g_i2c_Req;

/*!
    \brief      handle I2C0 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/

void I2C0_EV_IRQHandler(void)
{
#ifdef USE_I2C0_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_ADDSEND);
        g_i2c_Req.Channel = NM_PRIMARY_IPMB_BUS;
        g_i2c_Req.Size = 0; // start, clear recv count
        g_i2c_Req.Data[g_i2c_Req.Size++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        g_i2c_Req.Data[g_i2c_Req.Size++] = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C0);
        if (g_i2c_Req.Size <= 1){
            g_i2c_Req.Size = 0; //too short, Not a complete package
            return;
        }
        if(RecvForwardI2CDatMsg_Queue != NULL && RecvDatMsg_Queue != NULL)
        {
            if((g_i2c_Req.Data[1] & 0x04) == 0) // netFn even---Request: as slave,received a cmd
            {
                g_i2c_Req.Param = IPMI_REQUEST;
                err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
            }
            else  // netFn odd---Response: as master, The response received after an active message is sent
            {
                if(0){
                    g_i2c_Req.Param = IPMI_REQUEST;
                    err = xQueueSendFromISR(RecvForwardI2CDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }else{
                    g_i2c_Req.Param = FORWARD_IPMB_RESPONSE;
                    err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }
            }
			
			g_i2c_Req.Size = 0; // over, clear recv count
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            if (err == pdFAIL)
            {
                LOG_E("iic xQueueSendFromISR failed!");
            }
        }
    }

#else
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C0);
    }

#endif
}

/*!
    \brief      handle I2C0 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C0_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_AERR);
    }

    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    // i2c_interrupt_disable(I2C0, I2C_INT_ERR);
    // i2c_interrupt_disable(I2C0, I2C_INT_BUF);
    // i2c_interrupt_disable(I2C0, I2C_INT_EV);

    i2c_deinit(I2C0);
    i2c_channel_init(I2C0);
}

/*!
    \brief      handle I2C1 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C1_EV_IRQHandler(void)
{
#ifdef USE_I2C1_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_ADDSEND); 
        g_i2c_Req.Channel = NM_SECONDARY_IPMB_BUS;
        g_i2c_Req.Size = 0; // start, clear recv count
        g_i2c_Req.Data[g_i2c_Req.Size++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        g_i2c_Req.Data[g_i2c_Req.Size++] = i2c_data_receive(I2C1);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        //i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_STPDET);
        i2c_enable(I2C1);
        if (g_i2c_Req.Size <= 1){
            g_i2c_Req.Size = 0; //too short, Not a complete package
            return;
        }
        if(RecvForwardI2CDatMsg_Queue != NULL && RecvDatMsg_Queue != NULL)
        {
            if((g_i2c_Req.Data[1] & 0x04) == 0) // netFn even---Request: as slave,received a cmd
            {
                g_i2c_Req.Param = IPMI_REQUEST;
                err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
            }
            else  // netFn odd---Response: as master, The response received after an active message is sent
            {
                if(0){
                    g_i2c_Req.Param = IPMI_REQUEST;
                    err = xQueueSendFromISR(RecvForwardI2CDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }else{
                    g_i2c_Req.Param = FORWARD_IPMB_RESPONSE;
                    err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }
            }
			
