ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
			g_i2c_Req.Size = 0; // over, clear recv count
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            if (err == pdFAIL)
            {
                LOG_E("iic xQueueSendFromISR failed!");
            }
        }
    }

#else
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C1);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C1);
    }

#endif
}

/*!
    \brief      handle I2C1 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C1_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_AERR);
    }

    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    // i2c_interrupt_disable(I2C1, I2C_INT_ERR);
    // i2c_interrupt_disable(I2C1, I2C_INT_BUF);
    // i2c_interrupt_disable(I2C1, I2C_INT_EV);

    i2c_deinit(I2C1);
    i2c_channel_init(I2C1);
}

#ifdef I2C2
 
static void i2c2_int(void)
{
    i2c2_rcu_config();
    i2c2_gpio_config();
    i2c2_nvic_config();
    i2c2_config();
}

static void i2c2_rcu_config(void)
{
    /* enable I2C2 clock */
    rcu_periph_clock_enable(RCU_I2C2);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C2_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C2_SDA_GPIO_CLK);
}
/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_gpio_config(void)
{
    /* connect I2C2_SCL I2C2_SDA*/
    gpio_init(I2C2_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C2_SCL_PIN);
    gpio_init(I2C2_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C2_SDA_PIN);
#ifdef I2C2_REMAP
    gpio_pin_remap1_config(GPIO_PCF5, GPIO_PCF5_I2C2_REMAP0, ENABLE);
#endif
}

/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_config(void)
{
    // **************************** I2C2 *********************************************
    i2c_clock_config(I2C2, I2C_CLOCK_400K, I2C_DTCY_2);
    i2c_set_slave_addr(I2C2, SubDevice_GetMySlaveAddress(I2C2));

        /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C2, I2C_INT_ERR);
    i2c_interrupt_enable(I2C2, I2C_INT_EV);
    i2c_interrupt_enable(I2C2, I2C_INT_BUF);
}

/*!
    \brief      handle I2C1 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C2_EV_IRQHandler(void)
{
#ifdef USE_I2C2_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_ADDSEND);
        g_i2c_Req.Channel = NM_THIRD_IPMB_BUS;
        g_i2c_Req.Size = 0;; // start, clear recv count
        g_i2c_Req.Data[g_i2c_Req.Size++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
        g_i2c_Req.Data[g_i2c_Req.Size++] = i2c_data_receive(I2C2);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C2);
        if (g_i2c_Req.Size <= 1){
            g_i2c_Req.Size = 0; //too short, Not a complete package
            return;
        }
        if(RecvForwardI2CDatMsg_Queue != NULL && RecvDatMsg_Queue != NULL)
        {
            if((g_i2c_Req.Data[1] & 0x04) == 0) // netFn even---Request: as slave,received a cmd
            {
                g_i2c_Req.Param = IPMI_REQUEST;
                err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
            }
            else  // netFn odd---Response: as master, The response received after an active message is sent
            {
                if(0){
                    g_i2c_Req.Param = IPMI_REQUEST;
                    err = xQueueSendFromISR(RecvForwardI2CDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }else{
                    g_i2c_Req.Param = FORWARD_IPMB_RESPONSE;
                    err = xQueueSendFromISR(RecvDatMsg_Queue, (char*)&g_i2c_Req, &xHigherPriorityTaskWoken);
                }
            }
			g_i2c_Req.Size = 0; // over, clear recv count

            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            if (err == pdFAIL)
            {
                LOG_E("iic xQueueSendFromISR failed!");
            }
        }
    }
#else
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C2);
    }
#endif
}

/*!
    \brief      handle I2C1 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C2_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_AERR);
    }

