ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    i2c_interrupt_disable(I2C2, I2C_INT_ERR);
    i2c_interrupt_disable(I2C2, I2C_INT_BUF);
    i2c_interrupt_disable(I2C2, I2C_INT_EV);

    i2c_deinit(I2C2);
    i2c_channel_init(I2C2);
}

/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_nvic_config(void)
{
    nvic_irq_enable(I2C2_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C2_ER_IRQn, 8, 0);
}
#endif
static void i2c_set_as_slave_device_addr(uint32_t i2c_periph, uint8_t device_addr)
{
    /* I2C address configure */
    i2c_mode_addr_config(i2c_periph, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, device_addr);
    /* enable I2C0 */
    i2c_enable(i2c_periph);
    /* enable acknowledge */
    i2c_ack_config(i2c_periph, I2C_ACK_ENABLE);
}

bool i2c_write(uint32_t bus, const uint8_t *p_buffer, uint16_t len)
{
    switch (bus)
    {
        case 0:
        case I2C0:
            return i2c_bytes_write(I2C0, p_buffer[0], &p_buffer[1], len-1, 20000);
        case 1:
        case I2C1:
            return i2c_bytes_write(I2C1, p_buffer[0], &p_buffer[1], len-1, 20000);
        
    #ifdef I2C2
        case 2:
        case I2C2:
            return i2c_bytes_write(I2C2, p_buffer[0], &p_buffer[1], len-1, 20000);
    #endif   
        default:
			return false;
    }
}
void i2c_set_slave_addr(uint32_t bus, uint8_t device_addr)
{
    switch (bus)
    {
        case 0:
        case I2C0:
            i2c_set_as_slave_device_addr(I2C0, device_addr);
            break;
        case 1:
        case I2C1:
            i2c_set_as_slave_device_addr(I2C1, device_addr);
            break;
    #ifdef I2C2
        case 2:
        case I2C2:
            i2c_set_as_slave_device_addr(I2C2, device_addr);
            break;
    #endif   
        default:
			return;
    }
}

